content-org/tech.org
#+author: yuan.tops@gmail.com
#+hugo_base_dir: ../
#+HUGO_SECTION: tech
# Categories
#+filetags: @Tech
#+hugo_auto_set_lastmod: t

** 关于连接池大小
:PROPERTIES:
:EXPORT_HUGO_CATEGORIES: Tech
:EXPORT_FILE_NAME: about_pool_sizing
:EXPORT_DESCRIPTION: 连接池设多大合适，是个好问题；但肯定不是越大越好
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :keywords '( "pool" )
:END:

这篇文章讲得很好，值得一读:
*** About Pool Sizing
https://github.com/brettwooldridge/HikariCP/wiki/About-Pool-Sizing

*** 结论
综合CPU核数，磁盘IO，网络状况，得到一个经验公式:
#+BEGIN_QUOTE
connections = ((core_count * 2) + effective_spindle_count)
#+END_QUOTE

#+BEGIN_SRC txt
A formula which has held up pretty well across a lot of benchmarks for years is
that for optimal throughput the number of active connections should be somewhere
near ((core_count * 2) + effective_spindle_count). Core count should not include
HT threads, even if hyperthreading is enabled. Effective spindle count is zero if
the active data set is fully cached, and approaches the actual number of spindles
as the cache hit rate falls. ... There hasn't been any analysis so far regarding
how well the formula works with SSDs.
#+END_SRC
